Config/Documents/РешениеОбОценкеИмуществаМЗИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РешениеОбОценкеИмуществаМЗИК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОСогласовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяАналитикаСчета</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЭксплуатации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправедливаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределенаОценщиком</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодРыночныхЦен</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыОпределенияРыночныхЦенПриОценкеСтоимостиИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезолюцияКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РезолюцияКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отсутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РешениеОбОценкеИмуществаМЗИК/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// Параметры:
//  Ограничение - Структура:
//   * Текст - Строка
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Параметры заполнения КЭК в табличных частях документа:
//  - Имена табличных частей, содержащих КЭК.
//  - сторона проводки - Дт или Кт.
// 
// Возвращаемое значение:
//  Структура:
//   * ДтКт - Строка - "Дт" или "Кт"
//   * Включать105 - Булево - счета 105 не учитываются, при заполнении
//   * Включать108 - Булево - счета 108 учитываются
//   * ИменаТабличныхЧастей - Массив из Строка - Имена табличных частей содержащих КЭК
Функция ПараметрыЗаполненияКЭК() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДтКт", "Дт");
	Результат.Вставить("Включать105", Ложь);
	Результат.Вставить("Включать108", Истина);
	ИменаТабличныхЧастей = Новый Массив; // Массив из Строка
	ИменаТабличныхЧастей.Добавить("Материалы");
	Результат.Вставить("ИменаТабличныхЧастей", ИменаТабличныхЧастей);
	Возврат Результат;
КонецФункции

// Подготовить таблицу списание материальных запасов по документу.
// 
// Параметры:
//  Документ - ДокументОбъект.РешениеОбОценкеИмуществаМЗ
//  Параметры - Структура
// 
// Возвращаемое значение:
//  см. УправлениеМатериальнымиЗапасами.ПустаяТаблицаСоставДокументаДляСписанияМатериальныхЗапасовПоДокументу
Функция ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(Документ, Параметры) Экспорт
	
	Результат = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСоставДокументаДляСписанияМатериальныхЗапасовПоДокументу();
	Счет_02_6 = БухгалтерскийУчет.СчетПоКоду("02.6", Документ.Дата, Документ.Организация);
	Если Не ЗначениеЗаполнено(Счет_02_6) Тогда
		Возврат Результат;
	КонецЕсли; 
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет_02_6);
	ИмяСписка = "Материалы";
	СинонимСписка = НСтр("ru = 'Материалы'");
	
	Для Каждого СтрокаДокумента Из Документ.Материалы Цикл
		СтрокаРезультата = Результат.Добавить();
		СтрокаРезультата.ИмяСписка = ИмяСписка;
		СтрокаРезультата.СинонимСписка = СинонимСписка;
		СтрокаРезультата.НомерСтроки = СтрокаДокумента.НомерСтроки;
		СтрокаРезультата.ИФО = Документ.ИФО;
		СтрокаРезультата.КФО = СтрокаДокумента.КФО;
		СтрокаРезультата.Подразделение = Документ.Подразделение;
		СтрокаРезультата.ПодразделениеПолучатель = Документ.Подразделение;
		СтрокаРезультата.УчетПоПодразделениям = СвойстваСчета.УчетПоПодразделениям;
		СтрокаРезультата.РазрешитьНеУказыватьПодразделение = СвойстваСчета.РазрешитьНеУказыватьПодразделение;
		СтрокаРезультата.СчетУчета = Счет_02_6;
		СтрокаРезультата.Номенклатура = СтрокаДокумента.Номенклатура;
		СтрокаРезультата.ДопИзмерение = СтрокаДокумента.ЦМО;
		СтрокаРезультата.ДопИзмерениеВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО;
		СтрокаРезультата.Количество = СтрокаДокумента.Количество;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы.
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив; // Массив из Строка
	ИменаРеквизитов.Добавить("ЦМО");
	ИменаРеквизитов.Добавить("Номенклатура");
	ИменаРеквизитов.Добавить("Количество");
	Результат.Вставить("Материалы", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РешениеОбОценкеИмуществаМЗИК";
	КомандаПечати.Идентификатор		= "Решение0510442";
	КомандаПечати.Представление		= НСтр("ru = 'Решение об оценке имущества (ф. 0510442)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Решение0510442") Тогда
		
		ТабличныйДокумент = НапечататьРешение(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Решение0510442", "Решение об оценке имущества (ф. 0510442)", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

// Напечатать решение.
// 
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Напечатать решение
Функция НапечататьРешение(МассивОбъектов, ОбъектыПечати)
	
	ДанныеОрганизацийПечати = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	СоставКомиссий = ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов);

	ЧастиЗапроса = Новый Массив; // Массив из Строка
	ЧастиЗапроса.Добавить(ТекстЗапросаШапкиДляПечати0510442());
	ЧастиЗапроса.Добавить(ТекстЗапросаСоставНФАДляПечати0510442());
	ЧастиЗапроса.Добавить(УправлениеПечатьюБГУ.ТекстЗапросаФайлыДляПечатиПриказ61н());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[0].Выбрать();
	ВыборкаМЗ = РезультатЗапроса[1].Выбрать();
	ВыборкаФайлы = РезультатЗапроса[2].Выбрать();
	СтруктураПоиска = Новый Структура("Ссылка", Неопределено);
	
	ДанныеШапки = УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиРешенияОбОценкеИмущества0510442();
	Пока ВыборкаДокументов.Следующий() Цикл
	
		СтрокаШапки = ДанныеШапки.Добавить();
		СтрокаШапки.СоставДокумента = УправлениеПечатьюБГУ.ТаблицаСоставДокументаДляПечатиРешенияОбОценкеИмущества0510442();
		СтрокаШапки.СоставКомиссии = УправлениеПечатьюБГУ.ТаблицаКомиссияДляПечатиПриказ61н();
		СтрокаШапки.Файлы = УправлениеПечатьюБГУ.ТаблицаФайлыДляПечатиПриказ61н();
		
		ЗаполнитьЗначенияСвойств(СтрокаШапки, ВыборкаДокументов);
		УправлениеПечатьюБГУ.ЗаполнитьДанныеОрганизацииВСтрокеДляПечати100н(СтрокаШапки, ДанныеОрганизацийПечати);
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.Руководитель) Тогда
			ДанныеРуководителя = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаДокументов.Руководитель,
				"Фамилия,Имя,Отчество,НаименованиеПолное,ДолжностьНаименование",
				ВыборкаДокументов.Дата);
			СтрокаШапки.УполномоченноеЛицоДолжность = ДанныеРуководителя.ДолжностьНаименование;
			СтрокаШапки.УполномоченноеЛицоФИО = КорреспондентыКлиентСервер.ФИО(ДанныеРуководителя, Истина);
		Иначе
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
				ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата,
				ВыборкаДокументов.Подразделение);
			СтрокаШапки.УполномоченноеЛицоДолжность = Руководитель.ДолжностьПредставление;
			СтрокаШапки.УполномоченноеЛицоФИО = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
		КонецЕсли;
		
		СтруктураПоиска.Ссылка = ВыборкаДокументов.Ссылка;
		
		ВыборкаМЗ.Сбросить();
		
		Пока ВыборкаМЗ.НайтиСледующий(СтруктураПоиска) Цикл
			
			СтрокаМЗ = СтрокаШапки.СоставДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаМЗ, ВыборкаМЗ);
			Если ВыборкаМЗ.ОпределенаОценщиком Тогда
				СтрокаМЗ.ОценкаСумма = СтрокаМЗ.СправедливаяСтоимость;
				СтрокаМЗ.СправедливаяСтоимость = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаФайлы.Сбросить();
		Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
			ЗаполнитьЗначенияСвойств(СтрокаШапки.Файлы.Добавить(), ВыборкаФайлы);
		КонецЦикла;
		
		УправлениеПечатьюБГУ.ЗаполнитьКомиссиюДляПечати100н(СтрокаШапки.СоставКомиссии, СоставКомиссий, СтрокаШапки.Ссылка);
	
	КонецЦикла;
	
	Возврат УправлениеПечатьюБГУ.НапечататьРешениеОбОценкеНФА0510442(ДанныеШапки, ОбъектыПечати);
	
КонецФункции

Функция ТекстЗапросаШапкиДляПечати0510442()
	Возврат
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаМЗИК.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаМЗИК.Комиссия.НаименованиеПриказа КАК НаименованиеПриказа,
	|	РешениеОбОценкеИмуществаМЗИК.Комиссия.НомерПриказа КАК НомерПриказа,
	|	РешениеОбОценкеИмуществаМЗИК.Комиссия.ДатаПриказа КАК ДатаПриказа,
	|	РешениеОбОценкеИмуществаМЗИК.Ответственный КАК Ответственный,
	|	РешениеОбОценкеИмуществаМЗИК.Ссылка,
	|	РешениеОбОценкеИмуществаМЗИК.Номер,
	|	РешениеОбОценкеИмуществаМЗИК.Дата,
	|	РешениеОбОценкеИмуществаМЗИК.Организация,
	|	РешениеОбОценкеИмуществаМЗИК.ИФО,
	|	РешениеОбОценкеИмуществаМЗИК.Подразделение,
	|	РешениеОбОценкеИмуществаМЗИК.Подразделение.Наименование КАК НаименованиеСтруктурногоПодразделения,
	|	РешениеОбОценкеИмуществаМЗИК.Комиссия,
	|	РешениеОбОценкеИмуществаМЗИК.Комментарий,
	|	РешениеОбОценкеИмуществаМЗИК.Ответственный,
	|	РешениеОбОценкеИмуществаМЗИК.ОтветственныйИсполнитель,
	|	РешениеОбОценкеИмуществаМЗИК.ВидДокументаОСогласовании,
	|	РешениеОбОценкеИмуществаМЗИК.ДатаДокументаОСогласовании,
	|	РешениеОбОценкеИмуществаМЗИК.НомерДокументаОСогласовании,
	|	РешениеОбОценкеИмуществаМЗИК.Руководитель КАК Руководитель
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаМЗИК КАК РешениеОбОценкеИмуществаМЗИК
	|ГДЕ
	|	РешениеОбОценкеИмуществаМЗИК.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
КонецФункции

Функция ТекстЗапросаСоставНФАДляПечати0510442()
	Возврат
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.НомерСтроки КАК НомерСтроки,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.Наименование
	|		ИНАЧЕ РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОС,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.НоменклатурныйНомер = """"
	|			ТОГДА РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.Код
	|		ИНАЧЕ РешениеОбОценкеИмуществаМЗИКМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК ИнойНомер,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.Количество,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.Сумма,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.СправедливаяСтоимость,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.ОпределенаОценщиком,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.МетодРыночныхЦен,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.ОценкаНомер,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.ОценкаДата,
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.СрокЭксплуатации
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаМЗИК.Материалы КАК РешениеОбОценкеИмуществаМЗИКМатериалы
	|ГДЕ
	|	РешениеОбОценкеИмуществаМЗИКМатериалы.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки"
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
